#include <p18cxxx.h>

#pragma config FOSC=HS, WDT=OFF, BOR = ON_ACTIVE, BORV = 1, LVP=OFF, PBADEN=OFF, XINST = OFF, MCLRE = ON

#define srclk RA3
#define rclk  RA2
#define ser   RA5
//7  6  5  4  3  2  1  0
//v7 v6 v5 v4 v3 v2 v1 v0  
const unsigned char liushui[64]=
{
0B00000001,  //0
0B00000010,
0B00000100,
0B00001000,
0B00010000,
0B00100000,
0B01000000,
0B10000000,
0B11000000,
0B11100000,
0B11110000,   //10
0B11111000,
0B11111100,
0B11111110,
0B11111111,
0B11111110,
0B11111100,
0B11111000,
0B11110000,
0B11100000,
0B11000000,   //20
0B10000000,
0B10000000,
0B01000000,
0B00100000,
0B00010000,
0B00001000,
0B00000100,
0B00000010,
0B00000001,
0B00000010,  //30
0B00000100,
0B00001000,
0B00010000,
0B00100000,
0B01000000,
0B10000000,
0B01000000,
0B00100000,
0B00010000,
0B00001000,  //40
0B00000100,
0B00000010,
0B00000001,
0B00000011,
0B00000110,
0B00001100,
0B00011000,
0B00110000,
0B01100000,
0B11000000,  //50
0B00000000,
0B00000001,
0B00000101,
0B00010101,
0B01010101,  
0B01010111,
0B01011111,
0B01111111,
0B11111111,
0B00000000,  //60
0B10101010,
0B01010101,
0B00000000,  //63
};
//---------------------------------------
//名稱: 		 
//作者：cby
//公司：寧波芯動電子有限公司
//網址：www.MovingChip.com
//日期：20110601
//-----------------------------------------
void write595(unsigned char U6buf,unsigned char U7buf)
{
	unsigned char i;
	rclk=0;		
	for(i=0;i<8;i++)
	{ 
		if(U6buf&0x80)
			ser=1;
		else
			ser=0;
		U6buf=U6buf<<1;		
		srclk=0; 	
		asm("CLRWDT");
		asm("CLRWDT");	
		srclk=1; 
	}
	for(i=0;i<8;i++)
	{ 
		if(U7buf&0x80)
			ser=1;
		else
			ser=0;
		U7buf=U7buf<<1;		
		srclk=0; 	
		asm("CLRWDT");
		asm("CLRWDT");	
		srclk=1; 
	}
	rclk=1;
	asm("NOP");
  	asm("NOP");
  	rclk=0;
}
//---------------------------------------
//名稱: 主函數		 
//作者：cby
//公司：寧波芯動電子有限公司
//網址：www.MovingChip.com
//日期：20110601
//----------------------------------------- 
void main(void)
{	
	unsigned int a;
	unsigned char b;
	OSCCON=0X00;    		//選擇主震盪器
	ADCON1=0X0f;            //所有IO均為數字口，模擬量輸入禁止
	TRISA=0B00000000;   	//RA設置為輸出    	
	write595(0x00,0x00);
  	while(1)
  	{
    	if(++a>10000)    //延時10000個軟件週期，非精確定時
   		{
   			a=0;        //清零以備下次重新計數
			b++;        //步驟參數加1，以進一步
    		b&=0x3f;    //因為我們定義的表格長度為64，所以這裡需要限制步驟參數在0-63間
			write595(liushui[b],0x00);  //根據步驟參數查表格，將查出的數據通過SPI接口寫到74HC595中，在08-15輸出口中輸出	
   		}  
  	}
}
